{
  "devotionals": [
    {
      "day": "presence",
      "invocation": "Heavenly Father, open my heart to sense Your presence that fills every moment...",
      "scripture": {
        "reference": "Psalm 139:7-10",
        "text": "Where can I go from your Spirit? Where can I flee from your presence?..."
      },
      "promiseForTheDay": "I am never alone; God's presence surrounds me like the morning light",
      "promiseImage": "https://images.pexels.com/photos/1431822/pexels-photo-1431822.jpeg",
      "reflection": "When did you last tangibly feel God's presence?...",
      "physicalAction": "Close your eyes and place your hand over your heart...",
      "guidedPrayer": "Lord, I acknowledge that You are here, now, with me...",
      "truthToCarry": "I am never alone; God's presence goes with me everywhere.",
      "benediction": "May the God who is ever-present bless you and keep you...",
      "teaching": "Brother Lawrence, a 17th-century monk, discovered that washing dishes could be as sacred as formal prayer...",
      "insight": "The Celtic Christians understood that thin places exist where heaven and earth nearly touch..."
    },
    {
      "day": "healing",
      "invocation": "Healing God, You bind up the brokenhearted and restore our wounded souls...",
      "scripture": {
        "reference": "Psalm 147:3",
        "text": "He heals the brokenhearted and binds up their wounds."
      },
      "promiseForTheDay": "God's healing flows through me like a gentle stream, restoring what was broken",
      "promiseImage": "https://images.pexels.com/photos/1029604/pexels-photo-1029604.jpeg",
      "reflection": "What pain or wound are you carrying that needs God's healing touch?...",
      "physicalAction": "Place your hands palms-up on your lap as a posture of receiving...",
      "guidedPrayer": "Gentle Healer, I bring before You my wounded places...",
      "truthToCarry": "God's healing power is at work in me, even in my deepest wounds.",
      "benediction": "May the God who heals all your diseases bless and restore you...",
      "teaching": "Henri Nouwen wrote about the wounded healer - how our own brokenness becomes a source of compassion...",
      "insight": "In ancient times, healing springs were considered sacred places where the divine touched the physical world..."
    },
    {
      "day": "truth",
      "invocation": "God of Truth, shine Your light into the darkened corners of my mind...",
      "scripture": {
        "reference": "John 8:31-32",
        "text": "Then you will know the truth, and the truth will set you free."
      },
      "promiseForTheDay": "Truth illuminates my path and sets my spirit free from every lie",
      "promiseImage": "https://images.pexels.com/photos/1261728/pexels-photo-1261728.jpeg",
      "reflection": "What lies have you been believing about yourself, God, or others?...",
      "physicalAction": "Write down a lie you've believed on a piece of paper...",
      "guidedPrayer": "Father of Light, thank You that You are the God of truth...",
      "truthToCarry": "God's truth is breaking chains of deception and setting me free.",
      "benediction": "May the Spirit of Truth guide you into all truth today...",
      "teaching": "C.S. Lewis argued that truth is not relative but absolute, grounded in the character of God himself...",
      "insight": "The ancient Hebrew concept of truth (emet) implies not just factual accuracy but faithfulness and reliability..."
    }
  ]
}